In [46]:
import pandas as pd 
import numpy as np

In [47]:
def readInData(): 
    "Reads in the data needed - Currently courses at M"
    df_13 = pd.read_excel('/Users/filipbirkfeldt/git/easyplan/checkPoints_graduation/data_Poäng/dataM.xlsx', sheet_name='1-3')
    df_specialiseringar = pd.read_excel('/Users/filipbirkfeldt/git/easyplan/checkPoints_graduation/data_Poäng/dataM.xlsx',
sheet_name='Specialiseringar')
    df_ValfriaM = pd.read_excel('/Users/filipbirkfeldt/git/easyplan/checkPoints_graduation/data_Poäng/dataM.xlsx', sheet_name='Valfria_M')

    courses_df = df_13.append(df_specialiseringar)
    courses_df = courses_df.append(df_ValfriaM)

    courses_df.rename(columns={'Kurskod':'Kurskod'}, inplace=True)
    courses_df['Poäng'] = courses_df['Poäng'].fillna(0)
    courses_df['Poäng'] = courses_df['Poäng'].apply(lambda x:float(x))
    return courses_df

In [48]:
df = readInData()
print(df.columns)
df.head()

Index(['Kurskod', 'Poäng', 'Nivå', 'LUt', 'Språk', 'Kursnamn', 'Fot­not',
       'Länkar', 'Unnamed: 8', 'lp1', 'lp2', 'lp3', 'lp4', 'Typ',
       'Obl./ valfr.', 'Ingår i åk', 'Fr. åk', 'Unnamed: 11', 'Unnamed: 10'],
      dtype='object')

,Kurskod,Poäng,Nivå,LUt,Språk,Kursnamn,Fot­not,Länkar,Unnamed: 8,lp1,lp2,lp3,lp4,Typ,Obl./ valfr.,Ingår i åk,Fr. åk,Unnamed: 11,Unnamed: 10
0,FMAB45,5.0,G1,-,S,Endimensionell analys A1,NaN,KS KE U W T,NaN,1,NaN,NaN,NaN,1,NaN,NaN,NaN,NaN,NaN
1,MMKA25,6.0,G1,-,S,Ritteknik/datorstödd ritning,NaN,KS KE U W T,NaN,1,NaN,NaN,NaN,1,NaN,NaN,NaN,NaN,NaN
2,MMTA02,6.0,G1,-,S,Introduktion till maskinteknik,NaN,KS KE U W T,NaN,1,2.0,NaN,NaN,1,NaN,NaN,NaN,NaN,NaN
3,FMAB50,5.0,G1,-,S,Endimensionell analys A2,NaN,KS KE U W T,NaN,NaN,2.0,NaN,NaN,1,NaN,NaN,NaN,NaN,NaN
4,FMAB20,6.0,G1,-,S,Linjär algebra,NaN,KS KE U W T,NaN,NaN,2.0,NaN,NaN,1,NaN,NaN,NaN,NaN,NaN

In [49]:
df = df.drop(columns = ['LUt', 'Språk', 'Fot­not', 'Unnamed: 8', 'Unnamed: 10', 'Unnamed: 11', 'Länkar'])

In [50]:
df.head()

,Kurskod,Poäng,Nivå,Kursnamn,lp1,lp2,lp3,lp4,Typ,Obl./ valfr.,Ingår i åk,Fr. åk
0,FMAB45,5.0,G1,Endimensionell analys A1,1,NaN,NaN,NaN,1,NaN,NaN,NaN
1,MMKA25,6.0,G1,Ritteknik/datorstödd ritning,1,NaN,NaN,NaN,1,NaN,NaN,NaN
2,MMTA02,6.0,G1,Introduktion till maskinteknik,1,2.0,NaN,NaN,1,NaN,NaN,NaN
3,FMAB50,5.0,G1,Endimensionell analys A2,NaN,2.0,NaN,NaN,1,NaN,NaN,NaN
4,FMAB20,6.0,G1,Linjär algebra,NaN,2.0,NaN,NaN,1,NaN,NaN,NaN

In [52]:
df.to_excel('/Users/filipbirkfeldt/git/easyplan/checkPoints_graduation/data_Poäng/table2db.xlsx', index=False)

In [58]:
df = pd.read_excel('/Users/filipbirkfeldt/Desktop/table2db.xlsx')
df.rename(columns={'Poäng':'Poang', 'Nivå':'Niva', 'Obl./ valfr.':'Obl_valfr', 'Ingår i åk': 'InAk', 'Fr. åk':'FromYear'}, inplace=True)
df.head()

,Kurskod,Poang,Niva,Kursnamn,lp1,lp2,lp3,lp4,Typ,Obl_valfr,InAk,FromYear
0,FMAB45,5.0,G1,Endimensionell analys A1,1,NaN,NaN,NaN,1,NaN,NaN,NaN
1,MMKA25,6.0,G1,Ritteknik/datorstödd ritning,1,NaN,NaN,NaN,1,NaN,NaN,NaN
2,MMTA02,6.0,G1,Introduktion till maskinteknik,1,2.0,NaN,NaN,1,NaN,NaN,NaN
3,FMAB50,5.0,G1,Endimensionell analys A2,NaN,2.0,NaN,NaN,1,NaN,NaN,NaN
4,FMAB20,6.0,G1,Linjär algebra,NaN,2.0,NaN,NaN,1,NaN,NaN,NaN

In [59]:
print(df.FromYear.iloc[0])
print(type(df.FromYear.iloc[0]))

nan
<class 'numpy.float64'>

In [60]:
df.to_csv('/Users/filipbirkfeldt/Desktop/table2db.csv', index=False)